IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/LCD_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="LCD" HW_revision="1.0">
    <register id="LCD_PWREN" width="32" offset="0x800" description="Power enable">
        <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
        </bitfield>
    </register>
    <register id="LCD_RSTCTL" width="32" offset="0x804" description="Reset Control">
        <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
        </bitfield>
    </register>
    <register id="LCD_STAT" width="32" offset="0x814" description="Status Register">
        <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
            <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
        </bitfield>
    </register>
    <group id="LCD_INT_EVENT0" name="LCD_INT_EVENT0" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="LCD_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="LCD Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="FRAME_START" value="0x1" description="Start of new frame interrupt"/>
                <bitenum id="BLK_OFF" value="0x2" description="Blinking segments off interrupt"/>
                <bitenum id="BLK_ON" value="0x3" description="Blinking segments on interrupt"/>
            </bitfield>
        </register>
        <register id="LCD_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="FRMSTART" description="Start of new LCD frame." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="BLKOFF" description="Blinking segments off." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="BLKON" description="Blinkking segments on." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="LCD_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="FRMSTART" description="Set in start of a new frame." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Interrupt flag set"/>
            </bitfield>
            <bitfield id="BLKOFF" description="Blinking segments turned off interrupt flag." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Interrupt flag set"/>
            </bitfield>
            <bitfield id="BLKON" description="Blinking segments turned on." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Interrupt flag set"/>
            </bitfield>
        </register>
        <register id="LCD_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="FRMSTART" description="Master FRMSTART interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Interrupt flag set"/>
            </bitfield>
            <bitfield id="BLKOFF" description="Masked BLKOFF interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Masked interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Masked interrupt flag set"/>
            </bitfield>
            <bitfield id="BLKON" description="Masked BLKON interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Masked interrupt flag cleared"/>
                <bitenum id="SET" value="0x1" description="Masked interrupt flag set"/>
            </bitfield>
        </register>
        <register id="LCD_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="FRMSTART" description="Set FRMSTART RIS flag." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set corresponding RIS flag"/>
            </bitfield>
            <bitfield id="BLKOFF" description="Set BLKOFF RIS flag" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set corresponding RIS flag"/>
            </bitfield>
            <bitfield id="BLKON" description="Set BLKON RIS flag" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set corresponding RIS flag"/>
            </bitfield>
        </register>
        <register id="LCD_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="FRMSTART" description="Clear FRMSTART RIS flag" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear corresponding RIS flag"/>
            </bitfield>
            <bitfield id="BLKOFF" description="Clear BLKOFF RIS flag" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear corresponding RIS flag"/>
            </bitfield>
            <bitfield id="BLKON" description="Clear BLKON RIS flag" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear corresponding RIS flag"/>
            </bitfield>
        </register>
