IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/LCD_1.0.xml
    <register id="LCD_LCDPCTL0" width="32" offset="0x1114" description="LCD port control register 0">
        <bitfield id="LCDS0" description="LCD pin 0 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS1" description="LCD pin 1 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS10" description="LCD pin 10 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS11" description="LCD pin 11 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS12" description="LCD pin 12 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS13" description="LCD pin 13 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS14" description="LCD pin 14 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS15" description="LCD pin 15 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS2" description="LCD pin 2 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS3" description="LCD pin 3 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS4" description="LCD pin 4 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS5" description="LCD pin 5 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS6" description="LCD pin 6 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS7" description="LCD pin 7 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS8" description="LCD pin 8 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS9" description="LCD pin 9 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
    </register>
    <register id="LCD_LCDPCTL1" width="32" offset="0x1118" description="LCD port control register 1">
        <bitfield id="LCDS16" description="LCD segment line 16 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS17" description="LCD segment line 17 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS18" description="LCD segment line 18 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS19" description="LCD segment line 19 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS20" description="LCD segment line 20 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS21" description="LCD segment line 21 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS22" description="LCD segment line 22 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS23" description="LCD segment line 23 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS24" description="LCD pin 24 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS25" description="LCD pin 25 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS26" description="LCD pin 26 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS27" description="LCD pin 27 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS28" description="LCD pin 28 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS29" description="LCD pin 29 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS30" description="LCD pin 30 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS31" description="LCD pin 31 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
    </register>
    <register id="LCD_LCDPCTL2" width="32" offset="0x111C" description="LCD port control register 2">
        <bitfield id="LCDS32" description="LCD pin 32 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS33" description="LCD pin 33 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS34" description="LCD pin 34 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS35" description="LCD pin 35 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS36" description="LCD pin 36 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS37" description="LCD pin 37 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS38" description="LCD pin 38 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS39" description="LCD pin 39 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS40" description="LCD pin 40 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS41" description="LCD pin 41 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS42" description="LCD pin 42 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS43" description="LCD pin 43 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS44" description="LCD pin 44 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS45" description="LCD pin 45 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS46" description="LCD pin 46 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
        <bitfield id="LCDS47" description="LCD pin 47 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_PORT" value="0x0" description="Multiplexed pins are port functions."/>
            <bitenum id="SEL_LCD" value="0x1" description="Pins are LCD functions."/>
        </bitfield>
    </register>
