IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/LCD_1.0.xml
    <register id="LCD_LCDCSSEL2" width="32" offset="0x1130" description="LCD common segment select register 2">
        <bitfield id="LCDCSS32" description="Selects pin L32 as either common or segment line.  0b = Segment line 1b = Common line" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS33" description="Selects pin L33 as either common or segment line.  0b = Segment line 1b = Common line" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS34" description="Selects pin L34 as either common or segment line.  0b = Segment line 1b = Common line" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS35" description="Selects pin L35 as either common or segment line.  0b = Segment line 1b = Common line" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS36" description="Selects pin L36 as either common or segment line.  0b = Segment line 1b = Common line" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS37" description="Selects pin L37 as either common or segment line.  0b = Segment line 1b = Common line" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS38" description="Selects pin L38 as either common or segment line.  0b = Segment line 1b = Common line" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS39" description="Selects pin L39 as either common or segment line.  0b = Segment line 1b = Common line" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS40" description="Selects pin L40 as either common or segment line.  0b = Segment line 1b = Common line" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS41" description="Selects pin L41 as either common or segment line.  0b = Segment line 1b = Common line" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS42" description="Selects pin L42 as either common or segment line.  0b = Segment line 1b = Common line" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS43" description="Selects pin L43 as either common or segment line.  0b = Segment line 1b = Common line" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS44" description="Selects pin L44 as either common or segment line.  0b = Segment line 1b = Common line" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS45" description="Selects pin L45 as either common or segment line.  0b = Segment line 1b = Common line" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS46" description="Selects pin L46 as either common or segment line.  0b = Segment line 1b = Common line" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS47" description="Selects pin L47 as either common or segment line.  0b = Segment line 1b = Common line" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
    </register>
    <register id="LCD_LCDCSSEL3" width="32" offset="0x1134" description="LCD common segment select register 3">
        <bitfield id="LCDCSS48" description="Selects pin L48 as either common or segment line.  0b = Segment line 1b = Common line" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS49" description="Selects pin L49 as either common or segment line.  0b = Segment line 1b = Common line" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS50" description="Selects pin L50 as either common or segment line.  0b = Segment line 1b = Common line" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS51" description="Selects pin L51 as either common or segment line.  0b = Segment line 1b = Common line" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS52" description="Selects pin L52 as either common or segment line.  0b = Segment line 1b = Common line" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS53" description="Selects pin L53 as either common or segment line.  0b = Segment line 1b = Common line" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS54" description="Selects pin L54 as either common or segment line.  0b = Segment line 1b = Common line" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS55" description="Selects pin L55 as either common or segment line.  0b = Segment line 1b = Common line" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS56" description="Selects pin L56 as either common or segment line.  0b = Segment line 1b = Common line" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS57" description="Selects pin L57 as either common or segment line.  0b = Segment line 1b = Common line" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS58" description="Selects pin L58 as either common or segment line.  0b = Segment line 1b = Common line" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS59" description="Selects pin L59 as either common or segment line.  0b = Segment line 1b = Common line" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS60" description="Selects pin L60 as either common or segment line.  0b = Segment line 1b = Common line" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS61" description="Selects pin L61 as either common or segment line.  0b = Segment line 1b = Common line" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS62" description="Selects pin L62 as either common or segment line.  0b = Segment line 1b = Common line" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS63" description="Selects pin L63 as either common or segment line.  0b = Segment line 1b = Common line" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SEL_SEG" value="0x0" description="Segment line"/>
            <bitenum id="SEL_COM" value="0x1" description="Common line"/>
        </bitfield>
    </register>
    <register id="LCD_LCDM" width="8" offset="0x1140" instances="64" instaddr="0x1" description="LCD memory index register">
        <bitfield id="MBIT0" description="If LCD L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is static, 2-, 3- or 4-mux (000b &lt;= LCDMXx &lt;= 011b) 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM0 1b = Pin L[2*index] is used as COM0 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM0 1b = Pin L(index) is used as COM0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT1" description="If LCD pin L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is 2-, 3- or 4-mux (001b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM1 1b = Pin L[2*index] is used as COM1 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM1 1b = Pin L(index) is used as COM1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT2" description="If LCD pin L[2*index] is selected as segment line (LCDCSS[2*index] = 0b) and LCD mux rate is 3- or 4-mux (010b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM2 1b = Pin L[2*index] is used as COM2 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L[index-1] not used as COM2 1b = Pin L[index-1] is used as COM2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT3" description="If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 4-mux (LCDMXx=011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index] is selected as common line (LCDCSS[2*index] = 1b): 0b = Pin L[2*index] not used as COM3 1b = Pin L[2*index] is used as COM3 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 5-, 6-, 7- or 8-mux (LCDMXx &gt;= 100b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM3 1b = Pin L(index) is used as COM3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT4" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is static, 2-, 3- or 4-mux (000 &lt;= LCDMXx &lt;= 011b) 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*ndex+1] not used as COM0 1b = Pin L[2*ndex+1] is used as COM0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT5" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 2-, 3- or 4-mux (001b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM1 1b = Pin L[2*index+1] is used as COM1 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 6-, 7- or 8-mux (LCDMXx &gt;= 101b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM5 1b = Pin L(index) is used as COM5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
        <bitfield id="MBIT6" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 3- or 4-mux (010b &lt;= LCDMXx &lt;= 011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM2 1b = Pin L[2*index+1] is used as COM2 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 7- or 8-mux (LCDMXx &gt;= 110b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM6 1b = Pin L(index) is used as COM6" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MBIT7" description="If LCD pin L[2*index+1] is selected as segment line (LCDCSS[2*index+1] = 0b) and LCD mux rate is 4-mux (LCDMXx=011b): 0b = LCD segment off 1b = LCD segment on If LCD pin L[2*index+1] is selected as common line (LCDCSS[2*index+1] = 1b): 0b = Pin L[2*index+1] not used as COM3 1b = Pin L[2*index+1] is used as COM3 If LCD pin L(index) is selected as segment line (LCDCSS(index) = 0b) and LCD mux rate is 8-mux (LCDMXx = 111b): 0b = LCD segment off 1b = LCD segment on If LCD pin L(index) is selected as common line (LCDCSS(index) = 1b): 0b = Pin L(index) not used as COM7 1b = Pin L(index) is used as COM7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LCD segment/common off"/>
            <bitenum id="ON" value="0x1" description="LCD segment/common on"/>
        </bitfield>
    </register>
